templates/projectdiscovery-nuclei-templates__vmware-detect.yaml

http:
- extractors:
  - group: 1
    part: body
    regex:
    - <name>(.*?)</name>
    - <version>(.*?)</version>
    - <build>(.*?)</build>
    - <osType>(.*?)</osType>
    - <productLineId>(.*?)</productLineId>
    - <apiType>(.*?)</apiType>
    type: regex
  matchers:
  - status:
    - 200
    type: status
  - condition: or
    part: body
    type: word
    words:
    - ha-folder-root
    - RetrieveServiceContentResponse
  - part: header
    type: word
    words:
    - text/xml
  matchers-condition: and
  raw:
  - "POST /sdk/ HTTP/1.1\nHost: {{Hostname}}\n\n<?xml version=\"1.0\" encoding=\"\
    UTF-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    \ xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\
    >\n   <soap:Header>\n      <operationID>00000001-00000001</operationID>\n   </soap:Header>\n\
    \   <soap:Body>\n      <RetrieveServiceContent xmlns=\"urn:internalvim25\">\n\
    \         <_this xsi:type=\"ManagedObjectReference\" type=\"ServiceInstance\"\
    >ServiceInstance</_this>\n      </RetrieveServiceContent>\n   </soap:Body>\n</soap:Envelope>\n"
id: vmware-detect
info:
  author: elouhi
  description: Sends a POST request containing a SOAP payload to a vCenter server
    to obtain version information
  metadata:
    max-request: 1
  name: VMware Detection
  reference:
  - https://www.pwndefend.com/2021/09/23/exposed-vmware-vcenter-servers-around-the-world-cve-2021-22005/
  - https://svn.nmap.org/nmap/scripts/vmware-version.nse
  severity: info
  tags: tech,vcenter,vmware,discovery
